In [51]:
import pandas as pd
import numpy as np

In [52]:
days = pd.Series(['Monday', 'Tuesday', 'Wednesday'])
print(days)

0       Monday
1      Tuesday
2    Wednesday
dtype: object

In [53]:
# Creating series with numpy array
days_list = np.array(['Monday', 'Tuesday', 'Wednesday'])
a = pd.Series(days_list)
print(a)

0       Monday
1      Tuesday
2    Wednesday
dtype: object

In [54]:
# Using strings as index
days = pd.Series(['Monday', 'Tuesday', 'Wednesday'], index = ['a', 'b', 'c'])
print(days)

a       Monday
b      Tuesday
c    Wednesday
dtype: object

In [55]:
# Create series with dictionary
days_list = pd.Series({'a':'Monday', 'b':'Tuesday', 'c':'Wednesday'})
print(days_list)

a       Monday
b      Tuesday
c    Wednesday
dtype: object

In [56]:
days[0]

'Monday'

In [57]:
days_list[:2]

a     Monday
b    Tuesday
dtype: object

In [58]:
days_list['c']

'Wednesday'

In [59]:
# Create series from scalar
scalar_series = pd.Series(5., index = ['a','b','c','d','e'])
print(scalar_series)

a    5.0
b    5.0
c    5.0
d    5.0
e    5.0
dtype: float64

In [60]:
# Create a dataframe from a dictionary
df_dictionary = {'Country': ['Nigeria', 'Kenya', 'Togo', 'Ghana'], 'Capital': ['Abuja', 'Nairobi', 'Lome','Accra'], 'Population': [1000, 7000, 500, 6001], 'Age': [50, 40, 70, 90]}
s = pd.DataFrame(df_dictionary)
print(s)

   Country  Capital  Population  Age
0  Nigeria    Abuja        1000   50
1    Kenya  Nairobi        7000   40
2     Togo     Lome         500   70
3    Ghana    Accra        6001   90

In [61]:
df_dictionary = {'Country': ['Nigeria', 'Kenya', 'Togo', 'Ghana'], 'Capital': [np.NaN, 'Nairobi', 'Lome','Accra'], 'Population': [1000, np.NaN, 500, np.NaN], 'Age': [50, 40, 70, np.NaN]}
df = pd.DataFrame(df_dictionary)
print(df)

   Country  Capital  Population   Age
0  Nigeria      NaN      1000.0  50.0
1    Kenya  Nairobi         NaN  40.0
2     Togo     Lome       500.0  70.0
3    Ghana    Accra         NaN   NaN

In [62]:
df_dictionary = {'Country': ['Nigeria', 'Kenya', 'Togo', 'Ghana'], 'Capital': [np.NaN, 'Nairobi', 'Lome','Accra'], 'Population': [1000, np.NaN, 500, np.NaN], 'Age': [50, 40, 70, np.NaN]}
df = pd.DataFrame(df_dictionary)
df.isnull().sum()

Country       0
Capital       1
Population    2
Age           1
dtype: int64

In [63]:
df_dictionary = {'Country': ['Nigeria', 'Kenya', 'Togo', 'Ghana'], 'Capital': [np.NaN, 'Nairobi', 'Lome','Accra'], 'Population': [1000, np.NaN, 500, np.NaN], 'Age': [50, 40, 70, np.NaN]}
df = pd.DataFrame(df_dictionary)
df.fillna(0)

   Country  Capital  Population   Age
0  Nigeria        0      1000.0  50.0
1    Kenya  Nairobi         0.0  40.0
2     Togo     Lome       500.0  70.0
3    Ghana    Accra         0.0   0.0

In [64]:
df_dictionary = {'Country': ['Nigeria', 'Kenya', 'Togo', 'Ghana'], 'Capital': [np.NaN, 'Nairobi', 'Lome','Accra'], 'Population': [1000, np.NaN, 500, np.NaN], 'Age': [50, 40, 70, np.NaN]}
df = pd.DataFrame(df_dictionary)
df.replace()

   Country  Capital  Population   Age
0  Nigeria      NaN      1000.0  50.0
1    Kenya  Nairobi      1000.0  40.0
2     Togo     Lome       500.0  70.0
3    Ghana    Accra       500.0  70.0

In [65]:
df_dictionary = {'Country': ['Nigeria', 'Kenya', 'Togo', 'Ghana'], 'Capital': [np.NaN, 'Nairobi', 'Lome','Accra'], 'Population': [1000, np.NaN, 500, np.NaN], 'Age': [50, 40, 70, np.NaN]}
df = pd.DataFrame(df_dictionary)
df.notnull()

   Country  Capital  Population    Age
0     True    False        True   True
1     True     True       False   True
2     True     True        True   True
3     True     True       False  False

In [66]:
# View data
df.tail(3)

  Country  Capital  Population   Age
1   Kenya  Nairobi         NaN  40.0
2    Togo     Lome       500.0  70.0
3   Ghana    Accra         NaN   NaN

In [67]:
# View data
df.index

RangeIndex(start=0, stop=4, step=1)

In [68]:
# View data
df.columns

Index(['Country', 'Capital', 'Population', 'Age'], dtype='object')

In [69]:
# Select data
df['Population']

0    1000.0
1       NaN
2     500.0
3       NaN
Name: Population, dtype: float64

In [70]:
# Select data using boolean expression
df[df['Age'] < 50]

  Country  Capital  Population   Age
1   Kenya  Nairobi         NaN  40.0

In [71]:
# Select data
df.iloc[0:2]

   Country  Capital  Population   Age
0  Nigeria      NaN      1000.0  50.0
1    Kenya  Nairobi         NaN  40.0

In [73]:
df.describe()

        Population        Age
count     2.000000   3.000000
mean    750.000000  53.333333
std     353.553391  15.275252
min     500.000000  40.000000
25%     625.000000  45.000000
50%     750.000000  50.000000
75%     875.000000  60.000000
max    1000.000000  70.000000

In [89]:
df1 = {'Employee': ['James', 'Tope', 'Idris', 'Dorcas'], 'Group': ['Accounting', 'Engineering', 'HR', 'Engineering']}
df1 = pd.DataFrame(df1)
print(df1)

  Employee        Group
0    James   Accounting
1     Tope  Engineering
2    Idris           HR
3   Dorcas  Engineering

In [90]:
# # One-to-one joins
df2 = {'Employee': ['James', 'Tope', 'Idris', 'Dorcas'], 'Hire_date': [2021, 2015, 2010, 1950]}
df2 = pd.DataFrame(df2)
df3 = pd.merge(df1,df2)
df3

  Employee        Group  Hire_date
0    James   Accounting       2021
1     Tope  Engineering       2015
2    Idris           HR       2010
3   Dorcas  Engineering       1950

In [95]:
# Many-to-one joins
df4 = pd.DataFrame({'Group': ['Accounting', 'Engineering', 'HR'], 'Supervisor': ['Carly', 'Gbemisola', 'Steve']})
df5 = pd.merge(df3, df4)
df5

  Employee        Group  Hire_date Supervisor
0    James   Accounting       2021      Carly
1     Tope  Engineering       2015  Gbemisola
2   Dorcas  Engineering       1950  Gbemisola
3    Idris           HR       2010      Steve

In [97]:
# Many-to-many joins
df6 = pd.DataFrame({'Group': ['Accounting', 'Accounting', 'Engineering', 'HR', 'HR', 'Engineering'], 'Skills': ['Math', 'Spreadsheets', 'Coding', 'Linux', 'Spreadsheets', 'Organization']})
df7 = pd.merge(df5, df6)
df7

  Employee        Group  Hire_date Supervisor        Skills
0    James   Accounting       2021      Carly          Math
1    James   Accounting       2021      Carly  Spreadsheets
2     Tope  Engineering       2015  Gbemisola        Coding
3     Tope  Engineering       2015  Gbemisola  Organization
4   Dorcas  Engineering       1950  Gbemisola        Coding
5   Dorcas  Engineering       1950  Gbemisola  Organization
6    Idris           HR       2010      Steve         Linux
7    Idris           HR       2010      Steve  Spreadsheets